{"class_name": "Model", "keras_version": "2.0.4", "backend": "tensorflow", "config": {"name": "model_1", "output_layers": [["dense_1", 0, 0]], "layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 128, 128, 3], "dtype": "float32", "name": "input_1"}}, {"name": "conv2d_1", "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [3, 3], "trainable": true, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "activation": "linear", "name": "conv2d_1", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "filters": 16}}, {"name": "batch_normalization_1", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "beta_regularizer": null, "center": true, "beta_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_1", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true}}, {"name": "activation_1", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"name": "conv2d_2", "class_name": "Conv2D", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [3, 3], "trainable": true, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "activation": "linear", "name": "conv2d_2", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "filters": 16}}, {"name": "batch_normalization_2", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "beta_regularizer": null, "center": true, "beta_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_2", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true}}, {"name": "activation_2", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"name": "conv2d_3", "class_name": "Conv2D", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [3, 3], "trainable": true, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "activation": "linear", "name": "conv2d_3", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "filters": 16}}, {"name": "batch_normalization_3", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "beta_regularizer": null, "center": true, "beta_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_3", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true}}, {"name": "add_1", "class_name": "Add", "inbound_nodes": [[["activation_1", 0, 0, {}], ["batch_normalization_3", 0, 0, {}]]], "config": {"name": "add_1", "trainable": true}}, {"name": "activation_3", "class_name": "Activation", "inbound_nodes": [[["add_1", 0, 0, {}]]], "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"name": "conv2d_4", "class_name": "Conv2D", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [3, 3], "trainable": true, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "activation": "linear", "name": "conv2d_4", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "filters": 16}}, {"name": "batch_normalization_4", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "beta_regularizer": null, "center": true, "beta_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_4", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true}}, {"name": "activation_4", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"name": "conv2d_5", "class_name": "Conv2D", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [3, 3], "trainable": true, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "activation": "linear", "name": "conv2d_5", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "filters": 16}}, {"name": "batch_normalization_5", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "beta_regularizer": null, "center": true, "beta_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_5", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true}}, {"name": "add_2", "class_name": "Add", "inbound_nodes": [[["activation_3", 0, 0, {}], ["batch_normalization_5", 0, 0, {}]]], "config": {"name": "add_2", "trainable": true}}, {"name": "activation_5", "class_name": "Activation", "inbound_nodes": [[["add_2", 0, 0, {}]]], "config": {"name": "activation_5", "trainable": true, "activation": "relu"}}, {"name": "conv2d_6", "class_name": "Conv2D", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [3, 3], "trainable": true, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "activation": "linear", "name": "conv2d_6", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "filters": 16}}, {"name": "batch_normalization_6", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "beta_regularizer": null, "center": true, "beta_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_6", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true}}, {"name": "activation_6", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "config": {"name": "activation_6", "trainable": true, "activation": "relu"}}, {"name": "conv2d_7", "class_name": "Conv2D", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [3, 3], "trainable": true, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "activation": "linear", "name": "conv2d_7", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "filters": 16}}, {"name": "batch_normalization_7", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "beta_regularizer": null, "center": true, "beta_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_7", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true}}, {"name": "add_3", "class_name": "Add", "inbound_nodes": [[["activation_5", 0, 0, {}], ["batch_normalization_7", 0, 0, {}]]], "config": {"name": "add_3", "trainable": true}}, {"name": "activation_7", "class_name": "Activation", "inbound_nodes": [[["add_3", 0, 0, {}]]], "config": {"name": "activation_7", "trainable": true, "activation": "relu"}}, {"name": "conv2d_8", "class_name": "Conv2D", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [3, 3], "trainable": true, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "strides": [2, 2], "activation": "linear", "name": "conv2d_8", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "filters": 32}}, {"name": "batch_normalization_8", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "beta_regularizer": null, "center": true, "beta_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_8", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true}}, {"name": "activation_8", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "config": {"name": "activation_8", "trainable": true, "activation": "relu"}}, {"name": "conv2d_9", "class_name": "Conv2D", "inbound_nodes": [[["activation_8", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [3, 3], "trainable": true, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "activation": "linear", "name": "conv2d_9", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "filters": 32}}, {"name": "conv2d_10", "class_name": "Conv2D", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [1, 1], "trainable": true, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "strides": [2, 2], "activation": "linear", "name": "conv2d_10", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "filters": 32}}, {"name": "batch_normalization_9", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "beta_regularizer": null, "center": true, "beta_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_9", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true}}, {"name": "add_4", "class_name": "Add", "inbound_nodes": [[["conv2d_10", 0, 0, {}], ["batch_normalization_9", 0, 0, {}]]], "config": {"name": "add_4", "trainable": true}}, {"name": "activation_9", "class_name": "Activation", "inbound_nodes": [[["add_4", 0, 0, {}]]], "config": {"name": "activation_9", "trainable": true, "activation": "relu"}}, {"name": "conv2d_11", "class_name": "Conv2D", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [3, 3], "trainable": true, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "activation": "linear", "name": "conv2d_11", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "filters": 32}}, {"name": "batch_normalization_10", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "beta_regularizer": null, "center": true, "beta_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_10", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true}}, {"name": "activation_10", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "config": {"name": "activation_10", "trainable": true, "activation": "relu"}}, {"name": "conv2d_12", "class_name": "Conv2D", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [3, 3], "trainable": true, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "activation": "linear", "name": "conv2d_12", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "filters": 32}}, {"name": "batch_normalization_11", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "beta_regularizer": null, "center": true, "beta_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_11", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true}}, {"name": "add_5", "class_name": "Add", "inbound_nodes": [[["activation_9", 0, 0, {}], ["batch_normalization_11", 0, 0, {}]]], "config": {"name": "add_5", "trainable": true}}, {"name": "activation_11", "class_name": "Activation", "inbound_nodes": [[["add_5", 0, 0, {}]]], "config": {"name": "activation_11", "trainable": true, "activation": "relu"}}, {"name": "conv2d_13", "class_name": "Conv2D", "inbound_nodes": [[["activation_11", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [3, 3], "trainable": true, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "activation": "linear", "name": "conv2d_13", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "filters": 32}}, {"name": "batch_normalization_12", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "beta_regularizer": null, "center": true, "beta_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_12", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true}}, {"name": "activation_12", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "config": {"name": "activation_12", "trainable": true, "activation": "relu"}}, {"name": "conv2d_14", "class_name": "Conv2D", "inbound_nodes": [[["activation_12", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [3, 3], "trainable": true, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "activation": "linear", "name": "conv2d_14", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "filters": 32}}, {"name": "batch_normalization_13", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "beta_regularizer": null, "center": true, "beta_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_13", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true}}, {"name": "add_6", "class_name": "Add", "inbound_nodes": [[["activation_11", 0, 0, {}], ["batch_normalization_13", 0, 0, {}]]], "config": {"name": "add_6", "trainable": true}}, {"name": "activation_13", "class_name": "Activation", "inbound_nodes": [[["add_6", 0, 0, {}]]], "config": {"name": "activation_13", "trainable": true, "activation": "relu"}}, {"name": "conv2d_15", "class_name": "Conv2D", "inbound_nodes": [[["activation_13", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [3, 3], "trainable": true, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "strides": [2, 2], "activation": "linear", "name": "conv2d_15", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "filters": 64}}, {"name": "batch_normalization_14", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "beta_regularizer": null, "center": true, "beta_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_14", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true}}, {"name": "activation_14", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "config": {"name": "activation_14", "trainable": true, "activation": "relu"}}, {"name": "conv2d_16", "class_name": "Conv2D", "inbound_nodes": [[["activation_14", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [3, 3], "trainable": true, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "activation": "linear", "name": "conv2d_16", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "filters": 64}}, {"name": "conv2d_17", "class_name": "Conv2D", "inbound_nodes": [[["activation_13", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [1, 1], "trainable": true, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "strides": [2, 2], "activation": "linear", "name": "conv2d_17", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "filters": 64}}, {"name": "batch_normalization_15", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "beta_regularizer": null, "center": true, "beta_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_15", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true}}, {"name": "add_7", "class_name": "Add", "inbound_nodes": [[["conv2d_17", 0, 0, {}], ["batch_normalization_15", 0, 0, {}]]], "config": {"name": "add_7", "trainable": true}}, {"name": "activation_15", "class_name": "Activation", "inbound_nodes": [[["add_7", 0, 0, {}]]], "config": {"name": "activation_15", "trainable": true, "activation": "relu"}}, {"name": "conv2d_18", "class_name": "Conv2D", "inbound_nodes": [[["activation_15", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [3, 3], "trainable": true, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "activation": "linear", "name": "conv2d_18", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "filters": 64}}, {"name": "batch_normalization_16", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "beta_regularizer": null, "center": true, "beta_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_16", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true}}, {"name": "activation_16", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "config": {"name": "activation_16", "trainable": true, "activation": "relu"}}, {"name": "conv2d_19", "class_name": "Conv2D", "inbound_nodes": [[["activation_16", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [3, 3], "trainable": true, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "activation": "linear", "name": "conv2d_19", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "filters": 64}}, {"name": "batch_normalization_17", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "beta_regularizer": null, "center": true, "beta_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_17", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true}}, {"name": "add_8", "class_name": "Add", "inbound_nodes": [[["activation_15", 0, 0, {}], ["batch_normalization_17", 0, 0, {}]]], "config": {"name": "add_8", "trainable": true}}, {"name": "activation_17", "class_name": "Activation", "inbound_nodes": [[["add_8", 0, 0, {}]]], "config": {"name": "activation_17", "trainable": true, "activation": "relu"}}, {"name": "conv2d_20", "class_name": "Conv2D", "inbound_nodes": [[["activation_17", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [3, 3], "trainable": true, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "activation": "linear", "name": "conv2d_20", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "filters": 64}}, {"name": "batch_normalization_18", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "beta_regularizer": null, "center": true, "beta_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_18", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true}}, {"name": "activation_18", "class_name": "Activation", "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]], "config": {"name": "activation_18", "trainable": true, "activation": "relu"}}, {"name": "conv2d_21", "class_name": "Conv2D", "inbound_nodes": [[["activation_18", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [3, 3], "trainable": true, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "activation": "linear", "name": "conv2d_21", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}, "filters": 64}}, {"name": "batch_normalization_19", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "beta_regularizer": null, "center": true, "beta_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_19", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true}}, {"name": "add_9", "class_name": "Add", "inbound_nodes": [[["activation_17", 0, 0, {}], ["batch_normalization_19", 0, 0, {}]]], "config": {"name": "add_9", "trainable": true}}, {"name": "activation_19", "class_name": "Activation", "inbound_nodes": [[["add_9", 0, 0, {}]]], "config": {"name": "activation_19", "trainable": true, "activation": "relu"}}, {"name": "average_pooling2d_1", "class_name": "AveragePooling2D", "inbound_nodes": [[["activation_19", 0, 0, {}]]], "config": {"data_format": "channels_last", "strides": [8, 8], "trainable": true, "padding": "valid", "name": "average_pooling2d_1", "pool_size": [8, 8]}}, {"name": "flatten_1", "class_name": "Flatten", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "config": {"name": "flatten_1", "trainable": true}}, {"name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"use_bias": true, "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "units": 101, "activation": "softmax", "name": "dense_1", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}}}], "input_layers": [["input_1", 0, 0]]}}