{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.4", "config": [{"class_name": "Conv2D", "config": {"activation": "linear", "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "same", "kernel_constraint": null, "activity_regularizer": null, "batch_input_shape": [null, 64, 64, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "dtype": "float32", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "strides": [1, 1], "bias_regularizer": null, "name": "conv2d_1", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "filters": 64, "use_bias": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "axis": -1, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "batch_normalization_1", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true}}, {"class_name": "Dropout", "config": {"rate": 0.3, "name": "dropout_1", "trainable": true}}, {"class_name": "Conv2D", "config": {"activation": "linear", "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "same", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "strides": [1, 1], "bias_regularizer": null, "name": "conv2d_2", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "filters": 64, "use_bias": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "axis": -1, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "batch_normalization_2", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "name": "max_pooling2d_1", "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"activation": "linear", "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "same", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "strides": [1, 1], "bias_regularizer": null, "name": "conv2d_3", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "filters": 128, "use_bias": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_3", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "axis": -1, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "batch_normalization_3", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true}}, {"class_name": "Dropout", "config": {"rate": 0.4, "name": "dropout_2", "trainable": true}}, {"class_name": "Conv2D", "config": {"activation": "linear", "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "same", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "strides": [1, 1], "bias_regularizer": null, "name": "conv2d_4", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "filters": 128, "use_bias": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_4", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "axis": -1, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "batch_normalization_4", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "name": "max_pooling2d_2", "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"activation": "linear", "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "same", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "strides": [1, 1], "bias_regularizer": null, "name": "conv2d_5", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "filters": 256, "use_bias": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_5", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "axis": -1, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "batch_normalization_5", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true}}, {"class_name": "Dropout", "config": {"rate": 0.4, "name": "dropout_3", "trainable": true}}, {"class_name": "Conv2D", "config": {"activation": "linear", "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "same", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "strides": [1, 1], "bias_regularizer": null, "name": "conv2d_6", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "filters": 256, "use_bias": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_6", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "axis": -1, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "batch_normalization_6", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true}}, {"class_name": "Dropout", "config": {"rate": 0.4, "name": "dropout_4", "trainable": true}}, {"class_name": "Conv2D", "config": {"activation": "linear", "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "same", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "strides": [1, 1], "bias_regularizer": null, "name": "conv2d_7", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "filters": 256, "use_bias": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_7", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "axis": -1, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "batch_normalization_7", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "name": "max_pooling2d_3", "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"activation": "linear", "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "same", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "strides": [1, 1], "bias_regularizer": null, "name": "conv2d_8", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "filters": 512, "use_bias": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_8", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "axis": -1, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "batch_normalization_8", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true}}, {"class_name": "Dropout", "config": {"rate": 0.4, "name": "dropout_5", "trainable": true}}, {"class_name": "Conv2D", "config": {"activation": "linear", "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "same", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "strides": [1, 1], "bias_regularizer": null, "name": "conv2d_9", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "filters": 512, "use_bias": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_9", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "axis": -1, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "batch_normalization_9", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true}}, {"class_name": "Dropout", "config": {"rate": 0.4, "name": "dropout_6", "trainable": true}}, {"class_name": "Conv2D", "config": {"activation": "linear", "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "same", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "strides": [1, 1], "bias_regularizer": null, "name": "conv2d_10", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "filters": 512, "use_bias": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_10", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "axis": -1, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "batch_normalization_10", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "name": "max_pooling2d_4", "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"activation": "linear", "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "same", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "strides": [1, 1], "bias_regularizer": null, "name": "conv2d_11", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "filters": 512, "use_bias": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_11", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "axis": -1, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "batch_normalization_11", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true}}, {"class_name": "Dropout", "config": {"rate": 0.4, "name": "dropout_7", "trainable": true}}, {"class_name": "Conv2D", "config": {"activation": "linear", "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "same", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "strides": [1, 1], "bias_regularizer": null, "name": "conv2d_12", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "filters": 512, "use_bias": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_12", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "axis": -1, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "batch_normalization_12", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true}}, {"class_name": "Dropout", "config": {"rate": 0.4, "name": "dropout_8", "trainable": true}}, {"class_name": "Conv2D", "config": {"activation": "linear", "data_format": "channels_last", "bias_constraint": null, "trainable": true, "padding": "same", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "strides": [1, 1], "bias_regularizer": null, "name": "conv2d_13", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "filters": 512, "use_bias": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_13", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "axis": -1, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "batch_normalization_13", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "name": "max_pooling2d_5", "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"rate": 0.5, "name": "dropout_9", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "bias_constraint": null, "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0005000000237487257, "l1": 0.0}}, "units": 512, "use_bias": true, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_14", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "axis": -1, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "batch_normalization_14", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true}}, {"class_name": "Dense", "config": {"activation": "linear", "bias_constraint": null, "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "kernel_regularizer": null, "units": 200, "use_bias": true, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "softmax", "name": "activation_15", "trainable": true}}]}