{"keras_version": "2.0.4", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"use_bias": true, "activation": "linear", "kernel_constraint": null, "filters": 64, "name": "conv2d_1", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "dtype": "float32", "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "padding": "same", "batch_input_shape": [null, 32, 32, 3], "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"center": true, "name": "batch_normalization_1", "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.3, "trainable": true}}, {"class_name": "Conv2D", "config": {"use_bias": true, "activation": "linear", "kernel_constraint": null, "filters": 64, "name": "conv2d_2", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "padding": "same", "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"center": true, "name": "batch_normalization_2", "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_1", "trainable": true, "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"use_bias": true, "activation": "linear", "kernel_constraint": null, "filters": 128, "name": "conv2d_3", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "padding": "same", "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_3", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"center": true, "name": "batch_normalization_3", "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "rate": 0.4, "trainable": true}}, {"class_name": "Conv2D", "config": {"use_bias": true, "activation": "linear", "kernel_constraint": null, "filters": 128, "name": "conv2d_4", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "padding": "same", "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_4", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"center": true, "name": "batch_normalization_4", "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_2", "trainable": true, "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"use_bias": true, "activation": "linear", "kernel_constraint": null, "filters": 256, "name": "conv2d_5", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "padding": "same", "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_5", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"center": true, "name": "batch_normalization_5", "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "rate": 0.4, "trainable": true}}, {"class_name": "Conv2D", "config": {"use_bias": true, "activation": "linear", "kernel_constraint": null, "filters": 256, "name": "conv2d_6", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "padding": "same", "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_6", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"center": true, "name": "batch_normalization_6", "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "rate": 0.4, "trainable": true}}, {"class_name": "Conv2D", "config": {"use_bias": true, "activation": "linear", "kernel_constraint": null, "filters": 256, "name": "conv2d_7", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "padding": "same", "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_7", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"center": true, "name": "batch_normalization_7", "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_3", "trainable": true, "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"use_bias": true, "activation": "linear", "kernel_constraint": null, "filters": 512, "name": "conv2d_8", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "padding": "same", "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_8", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"center": true, "name": "batch_normalization_8", "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "rate": 0.4, "trainable": true}}, {"class_name": "Conv2D", "config": {"use_bias": true, "activation": "linear", "kernel_constraint": null, "filters": 512, "name": "conv2d_9", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "padding": "same", "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_9", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"center": true, "name": "batch_normalization_9", "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_6", "rate": 0.4, "trainable": true}}, {"class_name": "Conv2D", "config": {"use_bias": true, "activation": "linear", "kernel_constraint": null, "filters": 512, "name": "conv2d_10", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "padding": "same", "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_10", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"center": true, "name": "batch_normalization_10", "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_4", "trainable": true, "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"use_bias": true, "activation": "linear", "kernel_constraint": null, "filters": 512, "name": "conv2d_11", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "padding": "same", "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_11", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"center": true, "name": "batch_normalization_11", "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_7", "rate": 0.4, "trainable": true}}, {"class_name": "Conv2D", "config": {"use_bias": true, "activation": "linear", "kernel_constraint": null, "filters": 512, "name": "conv2d_12", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "padding": "same", "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_12", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"center": true, "name": "batch_normalization_12", "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_8", "rate": 0.4, "trainable": true}}, {"class_name": "Conv2D", "config": {"use_bias": true, "activation": "linear", "kernel_constraint": null, "filters": 512, "name": "conv2d_13", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "padding": "same", "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_13", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"center": true, "name": "batch_normalization_13", "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_5", "trainable": true, "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_9", "rate": 0.5, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "activation": "linear", "kernel_constraint": null, "name": "dense_1", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "units": 512}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_14", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"center": true, "name": "batch_normalization_14", "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_10", "rate": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "activation": "linear", "kernel_constraint": null, "name": "dense_2", "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "units": 1000}}, {"class_name": "Activation", "config": {"activation": "softmax", "name": "activation_15", "trainable": true}}]}