{"class_name": "Model", "keras_version": "2.0.4", "backend": "tensorflow", "config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["dense_1", 0, 0]], "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_1", "config": {"dtype": "float32", "sparse": false, "name": "input_1", "batch_input_shape": [null, 32, 32, 3]}}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_1", "config": {"filters": 16, "kernel_size": [3, 3], "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "activation": "linear", "name": "conv2d_1", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "batch_normalization_1", "config": {"axis": -1, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "center": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "momentum": 0.99, "name": "batch_normalization_1", "beta_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "name": "activation_1", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "name": "conv2d_2", "config": {"filters": 16, "kernel_size": [3, 3], "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "activation": "linear", "name": "conv2d_2", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "batch_normalization_2", "config": {"axis": -1, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "center": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "momentum": 0.99, "name": "batch_normalization_2", "beta_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "name": "activation_2", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "name": "conv2d_3", "config": {"filters": 16, "kernel_size": [3, 3], "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "activation": "linear", "name": "conv2d_3", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "batch_normalization_3", "config": {"axis": -1, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "center": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "momentum": 0.99, "name": "batch_normalization_3", "beta_regularizer": null}}, {"class_name": "Add", "inbound_nodes": [[["activation_1", 0, 0, {}], ["batch_normalization_3", 0, 0, {}]]], "name": "add_1", "config": {"trainable": true, "name": "add_1"}}, {"class_name": "Activation", "inbound_nodes": [[["add_1", 0, 0, {}]]], "name": "activation_3", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "name": "conv2d_4", "config": {"filters": 16, "kernel_size": [3, 3], "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "activation": "linear", "name": "conv2d_4", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "batch_normalization_4", "config": {"axis": -1, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "center": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "momentum": 0.99, "name": "batch_normalization_4", "beta_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "name": "activation_4", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "conv2d_5", "config": {"filters": 16, "kernel_size": [3, 3], "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "activation": "linear", "name": "conv2d_5", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "batch_normalization_5", "config": {"axis": -1, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "center": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "momentum": 0.99, "name": "batch_normalization_5", "beta_regularizer": null}}, {"class_name": "Add", "inbound_nodes": [[["activation_3", 0, 0, {}], ["batch_normalization_5", 0, 0, {}]]], "name": "add_2", "config": {"trainable": true, "name": "add_2"}}, {"class_name": "Activation", "inbound_nodes": [[["add_2", 0, 0, {}]]], "name": "activation_5", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "name": "conv2d_6", "config": {"filters": 16, "kernel_size": [3, 3], "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "activation": "linear", "name": "conv2d_6", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "batch_normalization_6", "config": {"axis": -1, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "center": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "momentum": 0.99, "name": "batch_normalization_6", "beta_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "name": "activation_6", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "name": "conv2d_7", "config": {"filters": 16, "kernel_size": [3, 3], "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "activation": "linear", "name": "conv2d_7", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "name": "batch_normalization_7", "config": {"axis": -1, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "center": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "momentum": 0.99, "name": "batch_normalization_7", "beta_regularizer": null}}, {"class_name": "Add", "inbound_nodes": [[["activation_5", 0, 0, {}], ["batch_normalization_7", 0, 0, {}]]], "name": "add_3", "config": {"trainable": true, "name": "add_3"}}, {"class_name": "Activation", "inbound_nodes": [[["add_3", 0, 0, {}]]], "name": "activation_7", "config": {"trainable": true, "name": "activation_7", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "name": "conv2d_8", "config": {"filters": 32, "kernel_size": [3, 3], "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "activation": "linear", "name": "conv2d_8", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "strides": [2, 2], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "name": "batch_normalization_8", "config": {"axis": -1, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "center": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "momentum": 0.99, "name": "batch_normalization_8", "beta_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "name": "activation_8", "config": {"trainable": true, "name": "activation_8", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_8", 0, 0, {}]]], "name": "conv2d_9", "config": {"filters": 32, "kernel_size": [3, 3], "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "activation": "linear", "name": "conv2d_9", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "name": "conv2d_10", "config": {"filters": 32, "kernel_size": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "activation": "linear", "name": "conv2d_10", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "strides": [2, 2], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "name": "batch_normalization_9", "config": {"axis": -1, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "center": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "momentum": 0.99, "name": "batch_normalization_9", "beta_regularizer": null}}, {"class_name": "Add", "inbound_nodes": [[["conv2d_10", 0, 0, {}], ["batch_normalization_9", 0, 0, {}]]], "name": "add_4", "config": {"trainable": true, "name": "add_4"}}, {"class_name": "Activation", "inbound_nodes": [[["add_4", 0, 0, {}]]], "name": "activation_9", "config": {"trainable": true, "name": "activation_9", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "name": "conv2d_11", "config": {"filters": 32, "kernel_size": [3, 3], "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "activation": "linear", "name": "conv2d_11", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "name": "batch_normalization_10", "config": {"axis": -1, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "center": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "momentum": 0.99, "name": "batch_normalization_10", "beta_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "name": "activation_10", "config": {"trainable": true, "name": "activation_10", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "name": "conv2d_12", "config": {"filters": 32, "kernel_size": [3, 3], "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "activation": "linear", "name": "conv2d_12", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "name": "batch_normalization_11", "config": {"axis": -1, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "center": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "momentum": 0.99, "name": "batch_normalization_11", "beta_regularizer": null}}, {"class_name": "Add", "inbound_nodes": [[["activation_9", 0, 0, {}], ["batch_normalization_11", 0, 0, {}]]], "name": "add_5", "config": {"trainable": true, "name": "add_5"}}, {"class_name": "Activation", "inbound_nodes": [[["add_5", 0, 0, {}]]], "name": "activation_11", "config": {"trainable": true, "name": "activation_11", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_11", 0, 0, {}]]], "name": "conv2d_13", "config": {"filters": 32, "kernel_size": [3, 3], "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "activation": "linear", "name": "conv2d_13", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "name": "batch_normalization_12", "config": {"axis": -1, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "center": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "momentum": 0.99, "name": "batch_normalization_12", "beta_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "name": "activation_12", "config": {"trainable": true, "name": "activation_12", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_12", 0, 0, {}]]], "name": "conv2d_14", "config": {"filters": 32, "kernel_size": [3, 3], "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "activation": "linear", "name": "conv2d_14", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "name": "batch_normalization_13", "config": {"axis": -1, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "center": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "momentum": 0.99, "name": "batch_normalization_13", "beta_regularizer": null}}, {"class_name": "Add", "inbound_nodes": [[["activation_11", 0, 0, {}], ["batch_normalization_13", 0, 0, {}]]], "name": "add_6", "config": {"trainable": true, "name": "add_6"}}, {"class_name": "Activation", "inbound_nodes": [[["add_6", 0, 0, {}]]], "name": "activation_13", "config": {"trainable": true, "name": "activation_13", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_13", 0, 0, {}]]], "name": "conv2d_15", "config": {"filters": 64, "kernel_size": [3, 3], "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "activation": "linear", "name": "conv2d_15", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "strides": [2, 2], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "name": "batch_normalization_14", "config": {"axis": -1, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "center": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "momentum": 0.99, "name": "batch_normalization_14", "beta_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "name": "activation_14", "config": {"trainable": true, "name": "activation_14", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_14", 0, 0, {}]]], "name": "conv2d_16", "config": {"filters": 64, "kernel_size": [3, 3], "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "activation": "linear", "name": "conv2d_16", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_13", 0, 0, {}]]], "name": "conv2d_17", "config": {"filters": 64, "kernel_size": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "activation": "linear", "name": "conv2d_17", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "strides": [2, 2], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "name": "batch_normalization_15", "config": {"axis": -1, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "center": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "momentum": 0.99, "name": "batch_normalization_15", "beta_regularizer": null}}, {"class_name": "Add", "inbound_nodes": [[["conv2d_17", 0, 0, {}], ["batch_normalization_15", 0, 0, {}]]], "name": "add_7", "config": {"trainable": true, "name": "add_7"}}, {"class_name": "Activation", "inbound_nodes": [[["add_7", 0, 0, {}]]], "name": "activation_15", "config": {"trainable": true, "name": "activation_15", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_15", 0, 0, {}]]], "name": "conv2d_18", "config": {"filters": 64, "kernel_size": [3, 3], "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "activation": "linear", "name": "conv2d_18", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "name": "batch_normalization_16", "config": {"axis": -1, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "center": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "momentum": 0.99, "name": "batch_normalization_16", "beta_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "name": "activation_16", "config": {"trainable": true, "name": "activation_16", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_16", 0, 0, {}]]], "name": "conv2d_19", "config": {"filters": 64, "kernel_size": [3, 3], "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "activation": "linear", "name": "conv2d_19", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "name": "batch_normalization_17", "config": {"axis": -1, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "center": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "momentum": 0.99, "name": "batch_normalization_17", "beta_regularizer": null}}, {"class_name": "Add", "inbound_nodes": [[["activation_15", 0, 0, {}], ["batch_normalization_17", 0, 0, {}]]], "name": "add_8", "config": {"trainable": true, "name": "add_8"}}, {"class_name": "Activation", "inbound_nodes": [[["add_8", 0, 0, {}]]], "name": "activation_17", "config": {"trainable": true, "name": "activation_17", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_17", 0, 0, {}]]], "name": "conv2d_20", "config": {"filters": 64, "kernel_size": [3, 3], "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "activation": "linear", "name": "conv2d_20", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "name": "batch_normalization_18", "config": {"axis": -1, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "center": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "momentum": 0.99, "name": "batch_normalization_18", "beta_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]], "name": "activation_18", "config": {"trainable": true, "name": "activation_18", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_18", 0, 0, {}]]], "name": "conv2d_21", "config": {"filters": 64, "kernel_size": [3, 3], "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "activation": "linear", "name": "conv2d_21", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "name": "batch_normalization_19", "config": {"axis": -1, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "center": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "momentum": 0.99, "name": "batch_normalization_19", "beta_regularizer": null}}, {"class_name": "Add", "inbound_nodes": [[["activation_17", 0, 0, {}], ["batch_normalization_19", 0, 0, {}]]], "name": "add_9", "config": {"trainable": true, "name": "add_9"}}, {"class_name": "Activation", "inbound_nodes": [[["add_9", 0, 0, {}]]], "name": "activation_19", "config": {"trainable": true, "name": "activation_19", "activation": "relu"}}, {"class_name": "AveragePooling2D", "inbound_nodes": [[["activation_19", 0, 0, {}]]], "name": "average_pooling2d_1", "config": {"pool_size": [8, 8], "padding": "valid", "data_format": "channels_last", "trainable": true, "strides": [8, 8], "name": "average_pooling2d_1"}}, {"class_name": "Flatten", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "name": "flatten_1", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "name": "dense_1", "config": {"activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "units": 1000, "activation": "softmax", "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}}}}]}}