{"class_name": "Model", "config": {"output_layers": [["activation_2", 0, 0]], "name": "model_2", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "name": "input_1", "sparse": false}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Model", "config": {"output_layers": [["dropout_9", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "name": "conv2d_1_input", "sparse": false}, "name": "conv2d_1_input", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "use_bias": true, "activation": "linear", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "batch_input_shape": [null, 32, 32, 3], "trainable": true, "name": "conv2d_1", "strides": [1, 1], "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "dtype": "float32", "kernel_constraint": null, "bias_regularizer": null, "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3]}, "name": "conv2d_1", "inbound_nodes": [[["conv2d_1_input", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "name": "activation_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "center": true, "trainable": true, "name": "batch_normalization_1", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_1", "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.3}, "name": "dropout_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "use_bias": true, "activation": "linear", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "padding": "same", "trainable": true, "name": "conv2d_2", "strides": [1, 1], "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3]}, "name": "conv2d_2", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "name": "activation_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "center": true, "trainable": true, "name": "batch_normalization_2", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_2", "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_1", "strides": [2, 2]}, "name": "max_pooling2d_1", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "use_bias": true, "activation": "linear", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "padding": "same", "trainable": true, "name": "conv2d_3", "strides": [1, 1], "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3]}, "name": "conv2d_3", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "name": "activation_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "center": true, "trainable": true, "name": "batch_normalization_3", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_3", "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.4}, "name": "dropout_2", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "use_bias": true, "activation": "linear", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "padding": "same", "trainable": true, "name": "conv2d_4", "strides": [1, 1], "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3]}, "name": "conv2d_4", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "name": "activation_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "center": true, "trainable": true, "name": "batch_normalization_4", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_4", "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_2", "strides": [2, 2]}, "name": "max_pooling2d_2", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "use_bias": true, "activation": "linear", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "padding": "same", "trainable": true, "name": "conv2d_5", "strides": [1, 1], "filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3]}, "name": "conv2d_5", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}, "name": "activation_5", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "center": true, "trainable": true, "name": "batch_normalization_5", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_5", "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "rate": 0.4}, "name": "dropout_3", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "use_bias": true, "activation": "linear", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "padding": "same", "trainable": true, "name": "conv2d_6", "strides": [1, 1], "filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3]}, "name": "conv2d_6", "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}, "name": "activation_6", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "center": true, "trainable": true, "name": "batch_normalization_6", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_6", "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_4", "rate": 0.4}, "name": "dropout_4", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "use_bias": true, "activation": "linear", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "padding": "same", "trainable": true, "name": "conv2d_7", "strides": [1, 1], "filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3]}, "name": "conv2d_7", "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_7", "activation": "relu"}, "name": "activation_7", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "center": true, "trainable": true, "name": "batch_normalization_7", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_7", "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_3", "strides": [2, 2]}, "name": "max_pooling2d_3", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "use_bias": true, "activation": "linear", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "padding": "same", "trainable": true, "name": "conv2d_8", "strides": [1, 1], "filters": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3]}, "name": "conv2d_8", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_8", "activation": "relu"}, "name": "activation_8", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "center": true, "trainable": true, "name": "batch_normalization_8", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_8", "inbound_nodes": [[["activation_8", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_5", "rate": 0.4}, "name": "dropout_5", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "use_bias": true, "activation": "linear", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "padding": "same", "trainable": true, "name": "conv2d_9", "strides": [1, 1], "filters": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3]}, "name": "conv2d_9", "inbound_nodes": [[["dropout_5", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_9", "activation": "relu"}, "name": "activation_9", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "center": true, "trainable": true, "name": "batch_normalization_9", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_9", "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_6", "rate": 0.4}, "name": "dropout_6", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "use_bias": true, "activation": "linear", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "padding": "same", "trainable": true, "name": "conv2d_10", "strides": [1, 1], "filters": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3]}, "name": "conv2d_10", "inbound_nodes": [[["dropout_6", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_10", "activation": "relu"}, "name": "activation_10", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "center": true, "trainable": true, "name": "batch_normalization_10", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_10", "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_4", "strides": [2, 2]}, "name": "max_pooling2d_4", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "use_bias": true, "activation": "linear", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "padding": "same", "trainable": true, "name": "conv2d_11", "strides": [1, 1], "filters": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3]}, "name": "conv2d_11", "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_11", "activation": "relu"}, "name": "activation_11", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "center": true, "trainable": true, "name": "batch_normalization_11", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_11", "inbound_nodes": [[["activation_11", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_7", "rate": 0.4}, "name": "dropout_7", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "use_bias": true, "activation": "linear", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "padding": "same", "trainable": true, "name": "conv2d_12", "strides": [1, 1], "filters": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3]}, "name": "conv2d_12", "inbound_nodes": [[["dropout_7", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_12", "activation": "relu"}, "name": "activation_12", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "center": true, "trainable": true, "name": "batch_normalization_12", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_12", "inbound_nodes": [[["activation_12", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_8", "rate": 0.4}, "name": "dropout_8", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "use_bias": true, "activation": "linear", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "padding": "same", "trainable": true, "name": "conv2d_13", "strides": [1, 1], "filters": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3]}, "name": "conv2d_13", "inbound_nodes": [[["dropout_8", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_13", "activation": "relu"}, "name": "activation_13", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "center": true, "trainable": true, "name": "batch_normalization_13", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_13", "inbound_nodes": [[["activation_13", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_5", "strides": [2, 2]}, "name": "max_pooling2d_5", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_9", "rate": 0.5}, "name": "dropout_9", "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]]}], "input_layers": [["conv2d_1_input", 0, 0]]}, "name": "model_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}, "name": "flatten_1", "inbound_nodes": [[["model_1", 1, 0, {}]]]}, {"class_name": "Dense", "config": {"bias_constraint": null, "use_bias": true, "activation": "linear", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "trainable": true, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512}, "name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "name": "activation_1", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "trainable": true, "name": "batch_normalization_1", "momentum": 0.99, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "center": true, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_1", "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.5}, "name": "dropout_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"bias_constraint": null, "use_bias": true, "activation": "linear", "kernel_regularizer": null, "trainable": true, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1000}, "name": "dense_2", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "softmax"}, "name": "activation_2", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]]}, "backend": "tensorflow", "keras_version": "2.0.4"}